---
kind: method
id: M:Autodesk.Revit.DB.InCanvasControlData.Dispose
source: html/a2fd1f89-85d4-a66f-52bc-241533915aff.htm
---
# Autodesk.Revit.DB.InCanvasControlData.Dispose Method

Releases all resources used by the InCanvasControlData

## Syntax (C#)
```csharp
public void Dispose()
```